[
  {
    "name": "Themed Environment - Mars",
    "text": "CUSTOM CONTEXT — THEMED ENVIRONMENT (REAL PLANET MARS)\n\nThe environment must depict the REAL planet Mars, not a fictional or stylized world.\n\nThis is NOT a game world, cartoon world, fantasy setting, or illustrative scene.\n\nDepict the surface of Mars as seen in real NASA rover photography:\n– Red and rust-colored soil\n– Rocky terrain\n– Dust, pebbles, and uneven ground\n– A barren, desolate outdoor landscape\n– Natural sunlight with realistic shadows\n\nDo not stylize the environment.\nDo not use bright pastel colors.\nDo not depict candy, castles, smiling objects, characters, or illustrations.\nDo not create a whimsical, playful, or cartoon-like scene.\n\nThe background must clearly read as the real planet Mars at first glance."
  },
  {
    "name": "Contextual - Test 1",
    "text": "This is a contextual product shot with NO people present.\n\nDo not depict children, hands, bodies, or people of any kind. The backpack must appear unattended.\n\nThe product must be shown attached to a kid’s school backpack that clearly reads as a school backpack (fabric or nylon, casual everyday style).\n\nDo not depict hockey bags, sports bags, duffel bags, athletic gear, locker rooms, ice rinks, or any sports-related equipment or context. If the bag resembles sports gear in any way, the image is invalid and must be regenerated.\n\nThe bag tag must hang naturally from the backpack using a metal wire keychain. The wire keychain must be visibly threaded through a real attachment point on the backpack (such as a zipper pull hole, metal ring, or sewn loop) and through the hole of the tag, forming a continuous closed loop.\n\nThe connection must be physically believable, with correct overlap, orientation, and natural gravity. Do not depict floating, clipped, glued, or implied connections.\n\nLighting should be natural daylight with realistic shadows and texture detail. The tag should be the visual focus."
  },
  {
    "name": "Contextual - Test 2",
    "text": "PRODUCT REDEFINITION (OVERRIDE):\n\nThis product is a GENERAL SCHOOL BACKPACK NAME TAG.\nIt is designed for everyday student backpacks and school use.\n\nIt is NOT a sports accessory.\nIt must NOT be interpreted, categorized, or treated as sports equipment.\n\nAny icon, symbol, or graphic on the tag is decorative only and does not indicate intended sport usage.\nThe product must always be placed in a non-sports, school-related context."
  },
  {
    "name": "Contexual - Test 3",
    "text": "ATTACHMENT (MANDATORY, MECHANICAL):\n\nThe product MUST be physically attached to the backpack using a METAL WIRE KEYCHAIN.\nA metal wire keychain is a thin steel cable forming a closed loop with a visible screw-lock barrel clasp.\n\nThe wire keychain must be clearly visible in the image, including the screw-lock barrel clasp.\n\nThe wire keychain must be threaded THROUGH:\n1) A real attachment point on the backpack (zipper pull hole, metal ring, or sewn loop), AND\n2) The hole of the tag,\nforming a single continuous closed loop that is the sole support for the tag’s weight.\n\nThe tag must be hanging freely from the backpack, suspended only by the wire keychain.\n\nDo NOT depict the tag resting against the bag without attachment.\nDo NOT depict the tag merely touching the bag.\nDo NOT depict implied attachment without visible hardware.\n\nNo other attachment methods are allowed:\nno split rings, no jump rings, no lobster clasps, no carabiners, no clips, no hooks,\nno ball chains, no lanyards, no straps, no string, no plastic loops.\n\nCAMERA REQUIREMENT:\nThe camera framing must clearly show the attachment point and the full wire keychain loop,\nincluding the barrel clasp. If the wire keychain is not clearly visible and mechanically\nattached as described, the image is invalid and must be regenerated."
  },
  {
    "name": "Youth Locker Room – Game Day",
    "text": "The product is shown attached to a youth hockey bag inside a clean locker room environment. The bag rests on a wooden bench with hockey skates, gloves, and a helmet nearby. Indoor arena lighting with soft shadows. No people present.\n\nATTACHMENT (MANDATORY, MECHANICAL):\n\nThe product MUST be physically attached to the bag using a METAL WIRE KEYCHAIN. A metal wire keychain is a thin steel cable forming a closed loop with a visible screw-lock barrel clasp.\n\nThe wire keychain must be clearly visible in the image, including the screw-lock barrel clasp.\n\nThe wire keychain must be threaded THROUGH:\n1) A real attachment point on the bag (zipper pull hole, metal ring, or sewn loop), AND\n2) The hole of the tag,\nforming a single continuous closed loop that is the sole support for the tag’s weight.\n\nThe tag must be hanging freely from the bag, suspended only by the wire keychain.\n\nDo NOT depict the tag resting against the bag without attachment.\nDo NOT depict the tag merely touching the bag.\nDo NOT depict implied attachment without visible hardware.\n\nNo other attachment methods are allowed:\nno split rings, no jump rings, no lobster clasps, no carabiners, no clips, no hooks,\nno ball chains, no lanyards, no straps, no string, no plastic loops.\n\nCAMERA REQUIREMENT:\nThe camera framing must clearly show the attachment point and the full wire keychain loop,\nincluding the barrel clasp. If the wire keychain is not clearly visible and mechanically\nattached as described, the image is invalid and must be regenerated."
  },
  {
    "name": "Contexual - Test 4",
    "text": "SCENE FOR THIS GENERATION:\n\nSetting: school hallway with lockers, clean and neutral.\nBag: a canvas school backpack in heather gray, soft structure, front zipper pocket, no athletic branding.\n\nATTACHMENT (MANDATORY, MECHANICAL):\nThe product is physically attached to the backpack using a metal wire keychain with a visible screw-lock barrel clasp.\nThe wire keychain is threaded through the zipper pull hole of the backpack and through the hole of the tag, forming a single continuous closed loop.\nThe tag hangs freely and is supported only by the wire keychain.\n\nCAMERA:\nTight framing focused on the attachment point.\nSlight left three-quarter angle.\nShallow depth of field with the tag and keychain in sharp focus.\n\nLIGHTING:\nNatural daylight from the left with soft shadows.\n\nNO PEOPLE PRESENT.\nNO SPORTS EQUIPMENT."
  }
]